# Instalasi Library

In [2]:
!pip install ipython-sql pandas sqlalchemy

Collecting ipython-sql
  Using cached ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Requirement already satisfied: pandas in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (2.3.0)
Collecting sqlalchemy
  Downloading sqlalchemy-2.0.41-cp311-cp311-macosx_11_0_arm64.whl.metadata (9.6 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.16.0-py3-none-any.whl.metadata (33 kB)
Collecting ipython (from ipython-sql)
  Downloading ipython-9.3.0-py3-none-any.whl.metadata (4.4 kB)
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.5.3-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (from ipython-sql) (1.17.0)
Collecting ipython-genutils (from ipython-sql)
  Using cached ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata (755 bytes)
Requirement already satisfied: numpy>=1.23.2 in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (from sqlalchemy) (4.14.0)
Collecting decorator (from ipython->ipython-sql)
  Downloading decorator-5.2.1-py3-none-any.whl.metadata (3.9 kB)
Collecting ipython-pygments-lexers (from ipython->ipython-sql)
  Downloading ipython_pygments_lexers-1.1.1-py3-none-any.whl.metadata (1.1 kB)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting matplotlib-inline (from ipython->ipython-sql)
  Using cached matplotlib_inline-0.1.7-py3-none-any.whl.metadata (3.9 kB)
Collecting pexpect>4.3 (from ipython->ipython-sql)
  Using cached pexpect-4.9.0-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting prompt_toolkit<3.1.0,>=3.0.41 (from ipython->ipython-sql)
  Downloading prompt_toolkit-3.0.51-py3-none-any.whl.metadata (6.4 kB)
Requirement already satisfied: pygments>=2.4.0 in ./.pyenv/versions/3.11.6/lib/python3.11/site-packages (from ipython->ipython-sql) (2.19.1)
Collecting stack_data (from ipython->ipython-sql)
  Using cached stack_data-0.6.3-py3-none-any.whl.metadata (18 kB)
Collecting traitlets>=5.13.0 (from ipython->ipython-sql)
  Using cached traitlets-5.14.3-py3-none-any.whl.metadata (10 kB)
Collecting wcwidth (from prettytable->ipython-sql)
  Using cached wcwidth-0.2.13-py2.py3-none-any.whl.metadata (14 kB)
Collecting parso<0.9.0,>=0.8.4 (from jedi>=0.16->ipython->ipython-sql)
  Using cached parso-0.8.4-py2.py3-none-any.whl.metadata (7.7 kB)
Collecting ptyprocess>=0.5 (from pexpect>4.3->ipython->ipython-sql)
  Using cached ptyprocess-0.7.0-py2.py3-none-any.whl.metadata (1.3 kB)
Collecting executing>=1.2.0 (from stack_data->ipython->ipython-sql)
  Downloading executing-2.2.0-py2.py3-none-any.whl.metadata (8.9 kB)
Collecting asttokens>=2.1.0 (from stack_data->ipython->ipython-sql)
  Downloading asttokens-3.0.0-py3-none-any.whl.metadata (4.7 kB)
Collecting pure-eval (from stack_data->ipython->ipython-sql)
  Downloading pure_eval-0.2.3-py3-none-any.whl.metadata (6.3 kB)
Using cached ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading sqlalchemy-2.0.41-cp311-cp311-macosx_11_0_arm64.whl (2.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 5.7 MB/s eta 0:00:00a 0:00:01
Downloading ipython-9.3.0-py3-none-any.whl (605 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 605.3/605.3 kB 7.4 MB/s eta 0:00:00
Using cached ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Downloading prettytable-3.16.0-py3-none-any.whl (33 kB)
Downloading sqlparse-0.5.3-py3-none-any.whl (44 kB)
Downloading jedi-0.19.2-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 6.9 MB/s eta 0:00:00a 0:00:01
Using cached pexpect-4.9.0-py2.py3-none-any.whl (63 kB)
Downloading prompt_toolkit-3.0.51-py3-none-any.whl (387 kB)
Using cached traitlets-5.14.3-py3-none-any.whl (85 kB)
Downloading decorator-5.2.1-py3-none-any.whl (9.2 kB)
Downloading ipython_pygments_lexers-1.1.1-py3-none-any.whl (8.1 kB)
Using cached matplotlib_inline-0.1.7-py3-none-any.whl (9.9 kB)
Using cached stack_data-0.6.3-py3-none-any.whl (24 kB)
Using cached wcwidth-0.2.13-py2.py3-none-any.whl (34 kB)
Downloading asttokens-3.0.0-py3-none-any.whl (26 kB)
Downloading executing-2.2.0-py2.py3-none-any.whl (26 kB)
Using cached parso-0.8.4-py2.py3-none-any.whl (103 kB)
Using cached ptyprocess-0.7.0-py2.py3-none-any.whl (13 kB)
Downloading pure_eval-0.2.3-py3-none-any.whl (11 kB)
Installing collected packages: wcwidth, pure-eval, ptyprocess, ipython-genutils, traitlets, sqlparse, sqlalchemy, prompt_toolkit, prettytable, pexpect, parso, ipython-pygments-lexers, executing, decorator, asttokens, stack_data, matplotlib-inline, jedi, ipython, ipython-sql
Successfully installed asttokens-3.0.0 decorator-5.2.1 executing-2.2.0 ipython-9.3.0 ipython-genutils-0.2.0 ipython-pygments-lexers-1.1.1 ipython-sql-0.5.0 jedi-0.19.2 matplotlib-inline-0.1.7 parso-0.8.4 pexpect-4.9.0 prettytable-3.16.0 prompt_toolkit-3.0.51 ptyprocess-0.7.0 pure-eval-0.2.3 sqlalchemy-2.0.41 sqlparse-0.5.3 stack_data-0.6.3 traitlets-5.14.3 wcwidth-0.2.13

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: pip install --upgrade pip

# Aktifkan SQL Magic

In [1]:
%load_ext sql

# Import Library

In [3]:
import pandas as pd
from sqlalchemy import create_engine

# Load Dataset ke Pandas dan Masukkan ke SQLite (In-Memory atau File)

In [5]:
# Baca file CSV
df = pd.read_csv("Downloads/HRDataset_v14.csv")

# Buat koneksi SQLite database ke file `hr_database.db`
engine = create_engine('sqlite:///hr_database.db')

# Simpan DataFrame ke SQLite sebagai tabel bernama 'employees'
df.to_sql('employees', con=engine, index=False, if_exists='replace')

311

# Memanggil Data tersimpan Dalam Database

In [43]:
%sql sqlite:///hr_database.db

In [45]:
%%sql

SELECT * FROM employees LIMIT 5;

 * sqlite:///hr_database.db
Done.

[('Adinolfi, Wilson  K', 10026, 0, 0, 1, 1, 5, 4, 0, 62506, 0, 19, 'Production Technician I', 'MA', 1960, '07/10/83', 'M ', 'Single', 'US Citizen', 'No', 'White', '7/5/2011', None, 'N/A-StillEmployed', 'Active', 'Production       ', 'Michael Albert', 22.0, 'LinkedIn', 'Exceeds', 4.6, 5, 0, '1/17/2019', 0, 1),
 ('Ait Sidi, Karthikeyan   ', 10084, 1, 1, 1, 5, 3, 3, 0, 104437, 1, 27, 'Sr. DBA', 'MA', 2148, '05/05/75', 'M ', 'Married', 'US Citizen', 'No', 'White', '3/30/2015', '6/16/2016', 'career change', 'Voluntarily Terminated', 'IT/IS', 'Simon Roup', 4.0, 'Indeed', 'Fully Meets', 4.96, 3, 6, '2/24/2016', 0, 17),
 ('Akinkuolie, Sarah', 10196, 1, 1, 0, 5, 5, 3, 0, 64955, 1, 20, 'Production Technician II', 'MA', 1810, '09/19/88', 'F', 'Married', 'US Citizen', 'No', 'White', '7/5/2011', '9/24/2012', 'hours', 'Voluntarily Terminated', 'Production       ', 'Kissy Sullivan', 20.0, 'LinkedIn', 'Fully Meets', 3.02, 3, 0, '5/15/2012', 0, 3),
 ('Alagbe,Trina', 10088, 1, 1, 0, 1, 5, 3, 0, 64991, 0, 19, 'Production Technician I', 'MA', 1886, '09/27/88', 'F', 'Married', 'US Citizen', 'No', 'White', '1/7/2008', None, 'N/A-StillEmployed', 'Active', 'Production       ', 'Elijiah Gray', 16.0, 'Indeed', 'Fully Meets', 4.84, 5, 0, '1/3/2019', 0, 15),
 ('Anderson, Carol ', 10069, 0, 2, 0, 5, 5, 3, 0, 50825, 1, 19, 'Production Technician I', 'MA', 2169, '09/08/89', 'F', 'Divorced', 'US Citizen', 'No', 'White', '7/11/2011', '9/6/2016', 'return to school', 'Voluntarily Terminated', 'Production       ', 'Webster Butler', 39.0, 'Google Search', 'Fully Meets', 5.0, 4, 0, '2/1/2016', 0, 2)]

In [47]:
%%sql
PRAGMA table_info(employees);

 * sqlite:///hr_database.db
Done.

[(0, 'Employee_Name', 'TEXT', 0, None, 0),
 (1, 'EmpID', 'BIGINT', 0, None, 0),
 (2, 'MarriedID', 'BIGINT', 0, None, 0),
 (3, 'MaritalStatusID', 'BIGINT', 0, None, 0),
 (4, 'GenderID', 'BIGINT', 0, None, 0),
 (5, 'EmpStatusID', 'BIGINT', 0, None, 0),
 (6, 'DeptID', 'BIGINT', 0, None, 0),
 (7, 'PerfScoreID', 'BIGINT', 0, None, 0),
 (8, 'FromDiversityJobFairID', 'BIGINT', 0, None, 0),
 (9, 'Salary', 'BIGINT', 0, None, 0),
 (10, 'Termd', 'BIGINT', 0, None, 0),
 (11, 'PositionID', 'BIGINT', 0, None, 0),
 (12, 'Position', 'TEXT', 0, None, 0),
 (13, 'State', 'TEXT', 0, None, 0),
 (14, 'Zip', 'BIGINT', 0, None, 0),
 (15, 'DOB', 'TEXT', 0, None, 0),
 (16, 'Sex', 'TEXT', 0, None, 0),
 (17, 'MaritalDesc', 'TEXT', 0, None, 0),
 (18, 'CitizenDesc', 'TEXT', 0, None, 0),
 (19, 'HispanicLatino', 'TEXT', 0, None, 0),
 (20, 'RaceDesc', 'TEXT', 0, None, 0),
 (21, 'DateofHire', 'TEXT', 0, None, 0),
 (22, 'DateofTermination', 'TEXT', 0, None, 0),
 (23, 'TermReason', 'TEXT', 0, None, 0),
 (24, 'EmploymentStatus', 'TEXT', 0, None, 0),
 (25, 'Department', 'TEXT', 0, None, 0),
 (26, 'ManagerName', 'TEXT', 0, None, 0),
 (27, 'ManagerID', 'FLOAT', 0, None, 0),
 (28, 'RecruitmentSource', 'TEXT', 0, None, 0),
 (29, 'PerformanceScore', 'TEXT', 0, None, 0),
 (30, 'EngagementSurvey', 'FLOAT', 0, None, 0),
 (31, 'EmpSatisfaction', 'BIGINT', 0, None, 0),
 (32, 'SpecialProjectsCount', 'BIGINT', 0, None, 0),
 (33, 'LastPerformanceReview_Date', 'TEXT', 0, None, 0),
 (34, 'DaysLateLast30', 'BIGINT', 0, None, 0),
 (35, 'Absences', 'BIGINT', 0, None, 0)]

# Proyek

## 1. Demografi Karyawan

### 1.1 Jumlah Karyawan berdasarkan Jenis Kelamin (Sex)

In [49]:
%%sql

SELECT Sex, COUNT(*) AS jumlah_karyawan
FROM employees
GROUP BY Sex
ORDER BY jumlah_karyawan DESC;

 * sqlite:///hr_database.db
Done.

[('F', 176), ('M ', 135)]

### 1.2 Distribusi Status Pernikahan (MaritalDesc)

In [51]:
%%sql

SELECT MaritalDesc, COUNT(*) AS jumlah_karyawan
FROM employees
GROUP BY MaritalDesc
ORDER BY jumlah_karyawan DESC;

 * sqlite:///hr_database.db
Done.

[('Single', 137),
 ('Married', 124),
 ('Divorced', 30),
 ('Separated', 12),
 ('Widowed', 8)]

### 1.3 Komposisi Ras (RaceDesc)

In [53]:
%%sql

SELECT RaceDesc, COUNT(*) AS jumlah_karyawan
FROM employees
GROUP BY RaceDesc
ORDER BY jumlah_karyawan DESC;

 * sqlite:///hr_database.db
Done.

[('White', 187),
 ('Black or African American', 80),
 ('Asian', 29),
 ('Two or more races', 11),
 ('American Indian or Alaska Native', 3),
 ('Hispanic', 1)]

### 1.4 Jumlah Karyawan berdasarkan Kewarganegaraan (CitizenDesc)

In [55]:
%%sql

SELECT CitizenDesc, COUNT(*) AS jumlah_karyawan
FROM employees
GROUP BY CitizenDesc
ORDER BY jumlah_karyawan DESC;

 * sqlite:///hr_database.db
Done.

[('US Citizen', 295), ('Eligible NonCitizen', 12), ('Non-Citizen', 4)]

### 1.5 Jumlah Karyawan berdasarkan Negara Bagian (State)

In [57]:
%%sql

SELECT State, COUNT(*) AS jumlah_karyawan
FROM employees
GROUP BY State
ORDER BY jumlah_karyawan DESC;

 * sqlite:///hr_database.db
Done.

[('MA', 276),
 ('CT', 6),
 ('TX', 3),
 ('VT', 2),
 ('WA', 1),
 ('VA', 1),
 ('UT', 1),
 ('TN', 1),
 ('RI', 1),
 ('PA', 1),
 ('OR', 1),
 ('OH', 1),
 ('NY', 1),
 ('NV', 1),
 ('NH', 1),
 ('ND', 1),
 ('NC', 1),
 ('MT', 1),
 ('ME', 1),
 ('KY', 1),
 ('IN', 1),
 ('ID', 1),
 ('GA', 1),
 ('FL', 1),
 ('CO', 1),
 ('CA', 1),
 ('AZ', 1),
 ('AL', 1)]

## 2. Struktur Organisasi

### 2.1 Jumlah Karyawan per Departemen (Department)

In [59]:
%%sql

SELECT Department, COUNT(*) AS jumlah_karyawan
FROM employees
GROUP BY Department
ORDER BY jumlah_karyawan DESC;

 * sqlite:///hr_database.db
Done.

[('Production       ', 209),
 ('IT/IS', 50),
 ('Sales', 31),
 ('Software Engineering', 11),
 ('Admin Offices', 9),
 ('Executive Office', 1)]

### 2.2 Jumlah Karyawan per Posisi atau Jabatan (Position)

In [61]:
%%sql

SELECT Position, COUNT(*) AS jumlah_karyawan
FROM employees
GROUP BY Position
ORDER BY jumlah_karyawan DESC;

 * sqlite:///hr_database.db
Done.

[('Production Technician I', 137),
 ('Production Technician II', 57),
 ('Area Sales Manager', 27),
 ('Production Manager', 14),
 ('Software Engineer', 10),
 ('IT Support', 8),
 ('Data Analyst', 7),
 ('Sr. Network Engineer', 5),
 ('Network Engineer', 5),
 ('Database Administrator', 5),
 ('BI Developer', 4),
 ('Senior BI Developer', 3),
 ('Sales Manager', 3),
 ('Administrative Assistant', 3),
 ('Accountant I', 3),
 ('Sr. DBA', 2),
 ('Sr. Accountant', 2),
 ('IT Manager - DB', 2),
 ('Software Engineering Manager', 1),
 ('Shared Services Manager', 1),
 ('Principal Data Architect', 1),
 ('President & CEO', 1),
 ('IT Manager - Support', 1),
 ('IT Manager - Infra', 1),
 ('IT Director', 1),
 ('Enterprise Architect', 1),
 ('Director of Sales', 1),
 ('Director of Operations', 1),
 ('Data Architect', 1),
 ('Data Analyst ', 1),
 ('CIO', 1),
 ('BI Director', 1)]

### 2.3 Rata-rata Gaji per Posisi (Position)

In [63]:
%%sql

SELECT Position, AVG(Salary) AS rata_rata_gaji
FROM employees
GROUP BY Position
ORDER BY rata_rata_gaji DESC;

 * sqlite:///hr_database.db
Done.

[('President & CEO', 250000.0),
 ('CIO', 220450.0),
 ('Director of Sales', 180000.0),
 ('IT Director', 178000.0),
 ('Director of Operations', 170500.0),
 ('IT Manager - Infra', 157000.0),
 ('Data Architect', 150290.0),
 ('IT Manager - DB', 144959.5),
 ('IT Manager - Support', 138888.0),
 ('Principal Data Architect', 120000.0),
 ('BI Director', 110929.0),
 ('Database Administrator', 108499.6),
 ('Enterprise Architect', 103613.0),
 ('Sr. Accountant', 102859.0),
 ('Sr. DBA', 102234.0),
 ('Software Engineer', 96719.2),
 ('BI Developer', 95465.0),
 ('Sr. Network Engineer', 93070.8),
 ('Shared Services Manager', 93046.0),
 ('Data Analyst', 89932.57142857143),
 ('Data Analyst ', 88527.0),
 ('Senior BI Developer', 84802.66666666667),
 ('Software Engineering Manager', 77692.0),
 ('Production Manager', 75294.5),
 ('Sales Manager', 69240.0),
 ('Area Sales Manager', 64932.555555555555),
 ('Production Technician II', 64892.21052631579),
 ('IT Support', 63684.375),
 ('Accountant I', 63507.666666666664),
 ('Network Engineer', 61605.0),
 ('Production Technician I', 55524.175182481755),
 ('Administrative Assistant', 52280.0)]

### 3.4 Rata-rata Gaji per Departemen (Department)

In [74]:
%%sql

SELECT Department, AVG(Salary) AS rata_rata_gaji
FROM employees
GROUP BY Department
ORDER BY rata_rata_gaji DESC;

 * sqlite:///hr_database.db
Done.

[('Executive Office', 250000.0),
 ('IT/IS', 97064.64),
 ('Software Engineering', 94989.45454545454),
 ('Admin Offices', 71791.88888888889),
 ('Sales', 69061.25806451614),
 ('Production       ', 59953.545454545456)]

### 3.5 Jumlah Bawahan per Manajer (ManagerName)

In [82]:
%%sql

SELECT ManagerName, COUNT(*) AS jumlah_bawahan
FROM employees
WHERE ManagerName IS NOT NULL
GROUP BY ManagerName
ORDER BY jumlah_bawahan DESC;

 * sqlite:///hr_database.db
Done.

[('Michael Albert', 22),
 ('Kissy Sullivan', 22),
 ('Kelley Spirea', 22),
 ('Elijiah Gray', 22),
 ('Brannon Miller', 22),
 ('Webster Butler', 21),
 ('Ketsia Liebig', 21),
 ('David Stanley', 21),
 ('Amy Dunn', 21),
 ('Janet King', 19),
 ('Simon Roup', 17),
 ('Peter Monroe', 14),
 ('John Smith', 14),
 ('Lynn Daneault', 13),
 ('Alex Sweetwater', 9),
 ('Brian Champaigne', 8),
 ('Jennifer Zamora', 7),
 ('Brandon R. LeBlanc', 7),
 ('Eric Dougall', 4),
 ('Debra Houlihan', 3),
 ('Board of Directors', 2)]

## 3. Analisis Gaji

### 3.1 Rata-rata, Maksimum, dan Minimum Gaji

In [89]:
%%sql
SELECT 
    AVG(Salary) AS rata_rata_gaji,
    MAX(Salary) AS gaji_maksimum,
    MIN(Salary) AS gaji_minimum
FROM employees;

 * sqlite:///hr_database.db
Done.

[(69020.6848874598, 250000, 45046)]

### 3.2 Distribusi Gaji berdasarkan Gender (Sex)

In [93]:
%%sql
SELECT 
    Sex, 
    COUNT(*) AS jumlah_karyawan,
    AVG(Salary) AS rata_rata_gaji,
    MAX(Salary) AS gaji_tertinggi,
    MIN(Salary) AS gaji_terendah
FROM employees
GROUP BY Sex
ORDER BY rata_rata_gaji DESC;

 * sqlite:///hr_database.db
Done.

[('M ', 135, 70629.4, 178000, 45115),
 ('F', 176, 67786.72727272728, 250000, 45046)]

### 3.3 Distribusi Gaji berdasarkan Status Pernikahan (MaritalDesc)

In [97]:
%%sql
SELECT 
    MaritalDesc, 
    COUNT(*) AS jumlah_karyawan,
    AVG(Salary) AS rata_rata_gaji,
    MAX(Salary) AS gaji_tertinggi,
    MIN(Salary) AS gaji_terendah
FROM employees
GROUP BY MaritalDesc
ORDER BY rata_rata_gaji DESC;

 * sqlite:///hr_database.db
Done.

[('Single', 137, 70052.57664233577, 220450, 45395),
 ('Married', 124, 69827.71774193548, 250000, 45433),
 ('Widowed', 8, 65195.125, 107226, 45046),
 ('Divorced', 30, 64427.333333333336, 148999, 45069),
 ('Separated', 12, 62934.333333333336, 74417, 52984)]

### 3.4 Top 5 Gaji Tertinggi

In [100]:
%%sql
SELECT Employee_Name, Position, Department, Salary
FROM employees
ORDER BY Salary DESC
LIMIT 5;

 * sqlite:///hr_database.db
Done.

[('King, Janet', 'President & CEO', 'Executive Office', 250000),
 ('Zamora, Jennifer', 'CIO', 'IT/IS', 220450),
 ('Houlihan, Debra', 'Director of Sales', 'Sales', 180000),
 ('Foss, Jason', 'IT Director', 'IT/IS', 178000),
 ('Corleone, Vito', 'Director of Operations', 'Production       ', 170500)]

### 3.5 Top 5 Gaji Terendah

In [103]:
%%sql
SELECT Employee_Name, Position, Department, Salary
FROM employees
ORDER BY Salary ASC
LIMIT 5;

 * sqlite:///hr_database.db
Done.

[('Zima, Colleen', 'Production Technician I', 'Production       ', 45046),
 ('Jacobi, Hannah  ', 'Production Technician I', 'Production       ', 45069),
 ('Rhoads, Thomas', 'Production Technician I', 'Production       ', 45115),
 ('Mahoney, Lauren  ', 'Production Technician I', 'Production       ', 45395),
 ('Kirill, Alexandra  ', 'Production Technician I', 'Production       ', 45433)]

### 3.6 Distribusi Gaji Berdasarkan Departemen

In [106]:
%%sql
SELECT Department, COUNT(*) AS jumlah_karyawan, AVG(Salary) AS rata_rata_gaji
FROM employees
GROUP BY Department
ORDER BY rata_rata_gaji DESC;

 * sqlite:///hr_database.db
Done.

[('Executive Office', 1, 250000.0),
 ('IT/IS', 50, 97064.64),
 ('Software Engineering', 11, 94989.45454545454),
 ('Admin Offices', 9, 71791.88888888889),
 ('Sales', 31, 69061.25806451614),
 ('Production       ', 209, 59953.545454545456)]

### 3.7 Standar Deviasi Gaji (jika ingin tahu ketimpangan)

In [111]:
%%sql
SELECT 
    AVG(Salary) AS rata_rata_gaji,
    MAX(Salary) - MIN(Salary) AS rentang_gaji,
    AVG((Salary - (SELECT AVG(Salary) FROM employees)) * (Salary - (SELECT AVG(Salary) FROM employees))) 
        AS varians_gaji
FROM employees;

 * sqlite:///hr_database.db
Done.

[(69020.6848874598, 204954, 630821473.6306077)]

## 4. Kinerja dan Produktivitas

### 4.1 Rata-rata Survei Keterlibatan & Kepuasan

In [117]:
%%sql
SELECT 
    ROUND(AVG(EngagementSurvey), 2) AS rata2_engagement_survey,
    ROUND(AVG(EmpSatisfaction), 2) AS rata2_kepuasan_karyawan
FROM employees;

 * sqlite:///hr_database.db
Done.

[(4.11, 3.89)]

### 4.2 Total dan Rata-rata Proyek Spesial

In [122]:
%%sql
SELECT 
    SUM(SpecialProjectsCount) AS total_proyek_spesial,
    ROUND(AVG(SpecialProjectsCount), 2) AS rata2_proyek_spesial
FROM employees;

 * sqlite:///hr_database.db
Done.

[(379, 1.22)]

### 4.3 Rata-rata Absensi dan Jumlah Totalnya

In [125]:
%%sql
SELECT 
    SUM(Absences) AS total_absen,
    ROUND(AVG(Absences), 2) AS rata2_absen
FROM employees;

 * sqlite:///hr_database.db
Done.

[(3184, 10.24)]

### 4.4 Rata-rata Keterlambatan 30 Hari Terakhir

In [128]:
%%sql
SELECT 
    SUM(DaysLateLast30) AS total_terlambat,
    ROUND(AVG(DaysLateLast30), 2) AS rata2_terlambat
FROM employees;

 * sqlite:///hr_database.db
Done.

[(129, 0.41)]

### 4.5 Distribusi Kinerja vs Absensi (Korelasi kasar)

In [131]:
%%sql
SELECT 
    PerformanceScore,
    COUNT(*) AS jumlah_karyawan,
    ROUND(AVG(Absences), 2) AS rata2_absen,
    ROUND(AVG(Salary), 2) AS rata2_gaji
FROM employees
GROUP BY PerformanceScore
ORDER BY rata2_absen DESC;

 * sqlite:///hr_database.db
Done.

[('Needs Improvement', 18, 11.33, 68407.56),
 ('Exceeds', 37, 10.49, 77144.86),
 ('Fully Meets', 243, 10.22, 68366.72),
 ('PIP', 13, 8.31, 58971.08)]

### 4.6 Rata-rata Skor Kinerja Berdasarkan Departemen

In [134]:
%%sql
SELECT 
    Department,
    COUNT(*) AS jumlah_karyawan,
    ROUND(AVG(Absences), 2) AS rata2_absen,
    ROUND(AVG(EngagementSurvey), 2) AS rata2_engagement
FROM employees
GROUP BY Department
ORDER BY rata2_engagement DESC;

 * sqlite:///hr_database.db
Done.

[('Executive Office', 1, 10.0, 4.83),
 ('Admin Offices', 9, 8.67, 4.39),
 ('IT/IS', 50, 10.44, 4.15),
 ('Production       ', 209, 10.14, 4.13),
 ('Software Engineering', 11, 8.73, 4.06),
 ('Sales', 31, 11.55, 3.82)]

## 5. Turnover dan Terminasi

### 5.1 Jumlah Karyawan yang Keluar

In [141]:
%%sql
SELECT COUNT(*) AS jumlah_keluar
FROM employees
WHERE Termd = 1;

 * sqlite:///hr_database.db
Done.

[(104,)]

### 5.2 Distribusi Alasan Keluar

In [173]:
%%sql
SELECT TermReason, COUNT(*) AS jumlah
FROM employees
WHERE Termd = 1
GROUP BY TermReason
ORDER BY jumlah DESC;

 * sqlite:///hr_database.db
Done.

[('Another position', 20),
 ('unhappy', 14),
 ('more money', 11),
 ('career change', 9),
 ('hours', 8),
 ('attendance', 7),
 ('return to school', 5),
 ('relocation out of area', 5),
 ('retiring', 4),
 ('performance', 4),
 ('no-call, no-show', 4),
 ('military', 4),
 ('medical issues', 3),
 ('maternity leave - did not return', 3),
 ('gross misconduct', 1),
 ('Learned that he is a gangster', 1),
 ('Fatal attraction', 1)]

### 5.3 Status Pekerjaan Terkini (Aktif vs Tidak Aktif)

In [147]:
%%sql
SELECT EmploymentStatus, COUNT(*) AS jumlah
FROM employees
GROUP BY EmploymentStatus
ORDER BY jumlah DESC;

 * sqlite:///hr_database.db
Done.

[('Active', 207), ('Voluntarily Terminated', 88), ('Terminated for Cause', 16)]

### 5.4. Rata-rata Lama Bekerja: Aktif vs Keluar

In [150]:
%%sql
SELECT 
    CASE 
        WHEN Termd = 1 THEN 'Keluar'
        ELSE 'Aktif'
    END AS status_karyawan,
    ROUND(AVG(
        CASE 
            WHEN Termd = 1 THEN julianday(DateofTermination) - julianday(DateofHire)
            ELSE julianday('now') - julianday(DateofHire)
        END
    ), 0) AS rata2_hari_bekerja
FROM employees
WHERE DateofHire IS NOT NULL;

 * sqlite:///hr_database.db
Done.

[('Aktif', None)]

### 5.6 Alasan Keluar Terbanyak per Departemen

In [159]:
%%sql
SELECT Department, TermReason, COUNT(*) AS jumlah
FROM employees
WHERE Termd = 1
GROUP BY Department, TermReason
ORDER BY Department, jumlah DESC;

 * sqlite:///hr_database.db
Done.

[('Admin Offices', 'no-call, no-show', 1),
 ('Admin Offices', 'career change', 1),
 ('IT/IS', 'performance', 2),
 ('IT/IS', 'no-call, no-show', 2),
 ('IT/IS', 'hours', 2),
 ('IT/IS', 'medical issues', 1),
 ('IT/IS', 'career change', 1),
 ('IT/IS', 'Learned that he is a gangster', 1),
 ('IT/IS', 'Another position', 1),
 ('Production       ', 'Another position', 17),
 ('Production       ', 'unhappy', 14),
 ('Production       ', 'more money', 11),
 ('Production       ', 'hours', 6),
 ('Production       ', 'career change', 6),
 ('Production       ', 'return to school', 5),
 ('Production       ', 'attendance', 5),
 ('Production       ', 'retiring', 4),
 ('Production       ', 'relocation out of area', 4),
 ('Production       ', 'military', 4),
 ('Production       ', 'performance', 2),
 ('Production       ', 'maternity leave - did not return', 2),
 ('Production       ', 'no-call, no-show', 1),
 ('Production       ', 'medical issues', 1),
 ('Production       ', 'gross misconduct', 1),
 ('Sales', 'relocation out of area', 1),
 ('Sales', 'maternity leave - did not return', 1),
 ('Sales', 'attendance', 1),
 ('Sales', 'Fatal attraction', 1),
 ('Sales', 'Another position', 1),
 ('Software Engineering', 'medical issues', 1),
 ('Software Engineering', 'career change', 1),
 ('Software Engineering', 'attendance', 1),
 ('Software Engineering', 'Another position', 1)]

### 5.7 Tren Tahunan Karyawan Masuk & Keluar

In [175]:
%%sql
SELECT 
    tahun,
    SUM(jumlah_masuk) AS jumlah_masuk,
    SUM(jumlah_keluar) AS jumlah_keluar
FROM (
    SELECT 
        strftime('%Y', DateofHire) AS tahun,
        COUNT(*) AS jumlah_masuk,
        0 AS jumlah_keluar
    FROM employees
    WHERE DateofHire IS NOT NULL
    GROUP BY tahun

    UNION ALL

    SELECT 
        strftime('%Y', DateofTermination) AS tahun,
        0 AS jumlah_masuk,
        COUNT(*) AS jumlah_keluar
    FROM employees
    WHERE Termd = 1 AND DateofTermination IS NOT NULL
    GROUP BY tahun
)
GROUP BY tahun
ORDER BY tahun;

 * sqlite:///hr_database.db
Done.

[(None, 311, 104)]